machv/esp8266-irrigator/src/main.cpp
#include <FS.h> //this needs to be first
#include <Arduino.h>
#include <WiFiManager.h> 
#include <ESP8266WebServer.h>
#include <PubSubClient.h>         //MQTT server library
#include <EasyButton.h>
#include <ArduinoJson.h>
#include "settings.h"             // Application settings
#include "FlowMeter.h"            // Flow meter

//for LED status
#include <Ticker.h>
Ticker ticker;

const char *ConfigFileName = "/config.json";
Config config; 

unsigned long relay1timeoutWhen;
unsigned long relay2timeoutWhen;

ESP8266WebServer server(80);

// MQTT
WiFiClient espClient;
PubSubClient mqttClient(espClient);
unsigned long lastMqttConnectionRetryTime;
unsigned long mqttReconnectDelay = 30000;
String mqttLwtTopic;
String mqttTopicRelay1;
String mqttTopicRelay2;

#define RELAY_COUNT 2

// PIN Definitions
#define PinMeter1 D5
#define PinMeter2 D6
#define PinRelay1 D2
#define PinRelay2 D3
#define PinButton1 D7
#define PinButton2 D4
#define PinLed1 D0
#define PinLed2 D1
#define PinLedStatus D8

bool relay1state = false;
bool relay2state = false;

EasyButton button1(PinButton1);
EasyButton button2(PinButton2);
//FlowMeter meter1(PinMeter1);
//FlowMeter meter2(PinMeter2);

const uint8_t METER_PINS[RELAY_COUNT] = { PinMeter1, PinMeter2 };
FlowMeter meters[RELAY_COUNT];

// The hall-effect flow sensor outputs approximately 4.5 pulses per second per
// litre/minute of flow.
float calibrationFactor = 4.5;

//Interrupt function, so that the counting of pulse “rise ups” dont interfere with the rest of the code  (attachInterrupt)


void tickStatusLed() {
  //toggle state
  int state = digitalRead(PinLedStatus);  // get the current state of GPIO1 pin
  digitalWrite(PinLedStatus, !state);     // set pin to the opposite state

  Serial.println("Status LED tick.");
}

void toggleRelay(int id) {
  uint8_t relayPin = 0;
  uint8_t ledPin = 0;
  String channel;
  
  switch(id) {
    case 1:
      relayPin = PinRelay1;
      ledPin = PinLed1;
      channel = mqttTopicRelay1;
      break;
    case 2:
      relayPin = PinRelay2;
      ledPin = PinLed2;
      channel = mqttTopicRelay2;
      break;
    default:
      return;
      break;
  }

  int currentValue = digitalRead(relayPin);
  int newValue = !currentValue;

  Serial.printf("Toggling relay #%d from %i to %i", id, currentValue, newValue);

  // Do the toggle
  // HIGH (0x1) = OFF, LOW (0x0) = ON
  digitalWrite(relayPin, newValue); // relay
  digitalWrite(ledPin, !newValue); // led
  
  if(id == 1) {
    relay1state = !newValue;

    if(relay1state && config.relay_1_timeout > 0) { // if enabling and is timeout set, activate
      relay1timeoutWhen = millis() + (config.relay_1_timeout * 60 * 1000); // timeout in settings is in minutes
    } else {
      relay1timeoutWhen = 0;
    }

  } else if (id == 2) {
    relay2state = !newValue;

    if(relay2state && config.relay_2_timeout > 0) { // if enabling and is timeout set, activate
      relay2timeoutWhen = millis() + (config.relay_2_timeout * 60 * 1000); // timeout in settings is in minutes
    } else {
      relay2timeoutWhen = 0;
    }
  }

  Serial.println();

  // And publish MQTT update
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Publishing updated state after toggle.");

    String value = String(!newValue); // actual state is negation of the PIN state
    mqttClient.publish(channel.c_str(), value.c_str());
  }
}

void mqttSubscriptionCallback(char* topic, byte* payload, unsigned int length) {
  // report to terminal for debug
  Serial.print("[MQTT] Received message in topic '");
  Serial.print(topic);
  Serial.print("' with content: ");
  for (uint i = 0; i < length; i++) {
    Serial.print((char)payload[i]);
  }
  Serial.println();

  // check if we received topics for state change 
  if (strcmp (mqttTopicRelay1.c_str(), topic) == 0) {
    Serial.printf("Relay 1 state change requested to %c", payload[0]);
    if(
        (payload[0] == '1' && relay1state == false) ||
        (payload[0] == '0' && relay1state == true)
      ) {
        Serial.print(", current state ");
        Serial.print(relay1state);
        Serial.println(" differs -> toggle");
        toggleRelay(1);
    } else {
      Serial.println();
    }
  } else if (strcmp (mqttTopicRelay2.c_str(), topic) == 0) {
    Serial.print("Relay 2 state change requested");
    if(
        (payload[0] == '1' && relay2state == false) ||
        (payload[0] == '0' && relay2state == true)
      ) {
           Serial.print(", current state ");
        Serial.print(relay2state);
        Serial.println(" differs -> toggle");
          toggleRelay(2);
    } else {
      Serial.println();
    }
  }  else {
    Serial.println("[MQTT] No match for any action.");
  }
}

void setupMqtt(int retries) { 
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Disconnecting...");
    mqttClient.disconnect();
  }

  if(config.mqtt_server.length() == 0) {
    return; // no server, no connection needed
  }
  
  mqttLwtTopic = String(config.mqtt_channel + "status");
  mqttTopicRelay1 = String(config.mqtt_channel + "1/state");
  mqttTopicRelay2 = String(config.mqtt_channel + "2/state");

  mqttClient.setServer(config.mqtt_server.c_str(), config.mqtt_port);
  mqttClient.setCallback(mqttSubscriptionCallback);

  const char *mqtt_user = nullptr;
  const char *mqtt_password = nullptr;
  if (config.mqtt_user.length() > 0) 
    mqtt_user = config.mqtt_user.c_str();
  if (config.mqtt_user.length() > 0) 
    mqtt_password = config.mqtt_password.c_str();

  // Build Client ID from MAC Address
  uint32_t chipId = ESP.getChipId();
  char clientId[20];
  snprintf(clientId, 20, "Zavlazovac-%08X", chipId);

  int retryCount = 0;
  while (!mqttClient.connected() && retryCount < retries) {
      Serial.printf("[MQTT] Connecting (retry %d of %d)...", (retryCount + 1), retries);
      Serial.println();
  
      bool connectionState = false;
      connectionState = mqttClient.connect(clientId, mqtt_user, mqtt_password, mqttLwtTopic.c_str(), 1, true, "Offline");
      
      if (connectionState) {
        Serial.println("[MQTT] Connected successfully.");  

        // publish online status to LWT
        mqttClient.publish(mqttLwtTopic.c_str(), "Online");
      } else {
        Serial.print("[MQTT] Connection failed with code: ");
        Serial.println(mqttClient.state());

        if(retryCount > 0) { // delay only if more retries are requested
          delay(1000);
        }
      }

