machv/esp8266-irrigator/src/main.cpp
      retryCount++;
  }

  // And subscribe to respective channels
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Publishing current states of relays.");
    String value1 = String(relay1state);
    mqttClient.publish(mqttTopicRelay1.c_str(), value1.c_str());
    String value2 = String(relay2state);
    mqttClient.publish(mqttTopicRelay2.c_str(), value2.c_str());

    Serial.println("[MQTT] Subscribing to the channels:");
    Serial.print("  - ");
    Serial.println(mqttTopicRelay1);
    mqttClient.subscribe(mqttTopicRelay1.c_str());
    
    Serial.print("  - ");
    Serial.println(mqttTopicRelay2);
    mqttClient.subscribe(mqttTopicRelay2.c_str());
  }

  lastMqttConnectionRetryTime = millis();
}

void connectMqtt() {
  setupMqtt(5); // By default try 5-times before gave up
}

// Gets called when WiFiManager enters configuration mode
void configModeCallback (WiFiManager *myWiFiManager) {
  Serial.println("Entered config mode");
  Serial.println(WiFi.softAPIP());
  //if you used auto generated SSID, print it
  Serial.println(myWiFiManager->getConfigPortalSSID());
  
  //entered config mode, make led toggle faster
  ticker.attach(0.2, tickStatusLed);
}

String SendStylesheetContent() {
  String ptr;

  ptr += "html { font-family: Helvetica; display: inline-block; margin: 0px auto; text-align: center;}\n";
  ptr += "body{margin-top: 50px;} h1 {color: #444444;margin: 50px auto 30px;} h3 {color: #444444;margin-bottom: 5px;}\n";
  ptr += ".button {display: block;background-color: #1abc9c;border: none;color: white;padding: 13px 30px;text-decoration: none;font-size: 25px;margin: 0px auto 15px;cursor: pointer;border-radius: 4px;}\n";
  ptr += ".button-on {background-color: #1abc9c;}\n";
  ptr += ".button-on:active {background-color: #16a085;}\n";
  ptr += ".button-off {background-color: #34495e;}\n";
  ptr += ".button-off:active {background-color: #2c3e50;}\n";
  ptr += ".settings-cell {text-align: center; font-size: 14pt; padding: 4px; padding-top: 20px}\n";
  ptr += "th, td {text-align: left; font-size: 12pt}";
  ptr += "input { padding: 5px; font-size: 12pt}";
  ptr += "table {margin: 0 auto; margin-bottom: 20px}\n";
  ptr += ".small { font-size: 75%}\n";
  ptr += "p {font-size: 14px;color: #888;margin-bottom: 10px;}\n";

  return ptr;
}

void handle_stylesheetFile() {
  server.send(200, "text/css", SendStylesheetContent()); 
}

String SendJavascriptContent() {
  String str = "";

  str += "function startTimer(duration, display) {\n"
    "var timer = duration, minutes, seconds;\n"
    "setInterval(function () {\n"
    "    minutes = parseInt(timer / 60, 10)\n"
    "    seconds = parseInt(timer % 60, 10);\n"
    "\n"
    "    minutes = minutes < 10 ? \"0\" + minutes : minutes;\n"
    "    seconds = seconds < 10 ? \"0\" + seconds : seconds;\n"
    "\n"
    "    display.textContent = minutes + \":\" + seconds;\n"
    "\n"
    "    if (--timer < 0) {\n"
    "        display.textContent = \"\";\n"         
    "    //    timer = duration;\n"
    "    }\n"
    "}, 1000);\n"
    "}\n";

  return str;
}

void handle_jsFile() {
  server.send(200, "text/javascript", SendJavascriptContent());
}

String SendSettingsHTML(){
  Serial.println("Sending Config HTML.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač / Settings</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "</head>\n";
  ptr += "<body><div class=\"page\">\n";
  ptr += "<h1>Zavlažovač</h1>\n";
  ptr += "<h2>Settings</h2>\n";
  
  if(server.hasArg("saved")) {
    ptr += "<div style=\"text-align: center; margin: 20px; font-weight: bold\">Configuration was saved.</div>";
  }

  ptr +="<form method=\"post\" enctype=\"application/x-www-form-urlencoded\">\n";
  ptr +="<table>\n"  
    "<tr>"
    " <th colspan=\"2\" class=\"settings-cell\">Relay 1</th>"
    "</tr>"
    
    "  <tr>\n"
    "    <th>Name</th>\n"
    "    <td><input type=\"text\" name=\"relay_1_name\" value=\"" + (config.relay_1_name) + "\"></td>\n"
    "  </tr>\n"
    
    "  <tr>\n"
    "    <th>Timeout</th>\n"
    "    <td><input type=\"text\" name=\"relay_1_timeout\" value=\"" + (config.relay_1_timeout) + "\"> min.<div class=\"small\">In minutes, 0 means no timeout.</div></td>\n"
    "  </tr>\n"

    "<tr>"
    " <th colspan=\"2\" class=\"settings-cell\">Relay 2</th>"
    "</tr>"

    "  <tr>\n"
    "    <th>Name</th>\n"
    "    <td><input type=\"text\" name=\"relay_2_name\" value=\"" + (config.relay_2_name) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th>Timeout</th>\n"
    "    <td><input type=\"text\" name=\"relay_2_timeout\" value=\"" + (config.relay_2_timeout) + "\"> min.<div class=\"small\">In minutes, 0 means no timeout.</div></td>\n"
    "  </tr>\n"

  "<tr>"
  "<th colspan=\"2\" class=\"settings-cell\">MQTT Settings</th>"
  "</tr>"
  "  <tr>\n"
  "    <th>Server</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_server\" value=\"" + (config.mqtt_server) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>Port</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_port\" value=\"" + (config.mqtt_port) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>User</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_user\" value=\"" + (config.mqtt_user) + "\"></td>\n"
  "  </tr>\n"

    "  <tr>\n"
  "    <th>Password</th>\n"
  "    <td><input type=\"password\" name=\"mqtt_password\" value=\"" + (config.mqtt_password) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>Channel prefix</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_channel\" value=\"" + (config.mqtt_channel) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th class=\"settings-cell\" colspan=\"2\"><input class=\"button\" type=\"submit\" value=\"Save Changes\"></th>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th class=\"settings-cell\" colspan=\"2\"><a href=\"/\" class=\"button\">Back</a></th>\n"
  "  </tr>\n"
  "</table>\n";
  
  ptr +="</form>\n"
        "</body>\n"
        "</html>\n";
  
  return ptr;
}

// t is time in seconds = millis()/1000;
char * millisToString(unsigned long millis)
{
  unsigned long seconds = millis / 1000;
  static char str[12];
  long h = seconds / 3600;
  seconds = seconds % 3600;
  int m = seconds / 60;
  int s = seconds % 60;
 sprintf(str, "%02ld:%02d:%02d", h, m, s);
 
 return str;
}

String SendHTML(){
  Serial.println("Sending homepage HTML.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "<script type=\"text/javascript\" src=\"scripts.js\"></script>\n";
  
