machv/esp8266-irrigator/src/main.cpp
  if(config.relay_1_timeout > 0 && relay1timeoutWhen > 0) {
    unsigned long remainingSecondsTimer1 = (relay1timeoutWhen - millis()) / 1000;
    ptr += "<script type=\"text/javascript\">\n"
          "window.onload = function () {\n"
          "  var timerSeconds = ";
    ptr += remainingSecondsTimer1;
    ptr += ";\n"
          "  var display = document.querySelector('#relay_1_timer');\n"
          "   startTimer(timerSeconds, display);\n"
          "};\n"
          "</script>";
  }

  if(config.relay_2_timeout > 0 && relay2timeoutWhen > 0) {
    unsigned long remainingSecondsTimer2 = (relay2timeoutWhen - millis()) / 1000;
    ptr += "<script type=\"text/javascript\">\n"
          "window.onload = function () {\n"
          "  var timerSeconds = ";
    ptr += remainingSecondsTimer2;
    ptr += ";\n"
          "  var display = document.querySelector('#relay_2_timer');\n"
          "   startTimer(timerSeconds, display);\n"
          "};\n"
          "</script>";
  }

  ptr += "</head>\n";
  ptr += "<body>\n<div class=\"page\">";
  ptr += "<h1>Zavlažovač</h1>\n";
  
  unsigned int frac;

  ptr += "<div>";
  ptr += "<h2>" + config.relay_1_name + "</h2>";

  if(config.relay_1_timeout > 0 && relay1timeoutWhen > 0) {
    ptr += "<h3 id=\"relay_1_timer\"></h3>";
  }

  ptr += "<table>";
  ptr += "<tr>"
         "<td colspan=\"2\" class=\"settings-cell\">";

  if(relay1state == true) {
    ptr += "<a class=\"button button-on\" href=\"/toggle?id=1\">Turn OFF</a>";
  } else {
    ptr += "<a class=\"button button-off\" href=\"/toggle?id=1\">Turn ON</a>";
  }
  ptr += "</td></tr>";

  if(config.relay_1_timeout > 0 && relay1timeoutWhen > 0) {
    ptr += "<tr>"
        "<th>Timer off after:</th>"
        "<td>";
    ptr += millisToString(relay1timeoutWhen - millis());
    ptr += "</td></tr>";
  }

    ptr += "<tr>"
        "<th>Flow rate:</th>"
        "<td>";
  ptr += int(meters[0].flowRate); // Print the integer part of the variable
  ptr += "."; // Print the decimal point
  // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
  frac = (meters[0].flowRate - int(meters[0].flowRate)) * 10;
  ptr += frac; // Print the fractional part of the variable
  ptr += " L/min</td>"
        "</tr>"
        "<tr>"
        "<th>Current Liquid Flowing:</th>"
        "<td>";
  ptr += meters[0].flowMilliLitres;
  ptr += " mL/Sec</td>"
        "</tr>"
        "<tr>"
        "<th>Output Liquid Quantity:</th>"
        "<td>";
  ptr += meters[0].totalMilliLitres;
  ptr += " mL</td>"
         "</tr>";
  ptr += "</table>";
  ptr += "</div>";

  ptr += "<div>";
  ptr += "<h2>" + config.relay_2_name + "</h2>";

  if(config.relay_2_timeout > 0 && relay2timeoutWhen > 0) {
    ptr += "<h3 id=\"relay_2_timer\"></h3>";
  }

  ptr += "<table>";
  ptr += "<tr>"
         "<td colspan=\"2\" class=\"settings-cell\">";
  
  if(relay2state == true) {
    ptr += "<a class=\"button button-on\" href=\"/toggle?id=2\">Turn OFF</a>";
  } else {
    ptr += "<a class=\"button button-off\" href=\"/toggle?id=2\">Turn ON</a>";
  }
  ptr += "</td></tr>";

  if(config.relay_2_timeout > 0 && relay2timeoutWhen > 0) {
    ptr += "<tr>"
        "<th>Turn off after:</th>"
        "<td>";
    ptr += millisToString(relay2timeoutWhen - millis());
    ptr += "</td></tr>";
  }

  ptr += "<tr>"
         "<th>Flow rate:</th>"
         "<td>";
  ptr += int(meters[1].flowRate); // Print the integer part of the variable
  ptr += "."; // Print the decimal point
  // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
  frac = (meters[1].flowRate - int(meters[1].flowRate)) * 10;
  ptr += frac; // Print the fractional part of the variable
  ptr += " L/min</td>"
        "</tr>"
        "<tr>"
        "<th>Current Liquid Flowing:</th>"
        "<td>";
  ptr += meters[1].flowMilliLitres / 1000;
  ptr += " L/Sec</td>"
        "</tr>"
        "<tr>"
        "<th>Output Liquid Quantity:</th>"
        "<td>";
  ptr += meters[1].totalMilliLitres / 1000;
  ptr += " L</td>"
         "</tr>";
  ptr += "</table>";

  ptr += "</div>";

  ptr +="<hr>\n";
  ptr +="<a class=\"button\" href=\"/config\">Configuration</a>\n";
  ptr +="</div></body>\n";
  ptr +="</html>\n";
  return ptr;
}

void handle_pageConfig() {
  server.send(200, "text/html", SendSettingsHTML()); 
}

void handle_saveConfig() {
  // Save runtime data
  String arg;
  arg = server.arg("mqtt_port");
  arg.trim();
  
  config.mqtt_port = (arg.length() == 0 ? 1883 : arg.toInt());
  config.mqtt_server = server.arg("mqtt_server");
  config.mqtt_user = server.arg("mqtt_user"); 
  config.mqtt_password = server.arg("mqtt_password");
  config.relay_1_name = server.arg("relay_1_name");
  config.relay_2_name = server.arg("relay_2_name");
  
  arg = server.arg("relay_1_timeout");
  arg.trim();
  config.relay_1_timeout = (arg.length() == 0 ? 0 : arg.toInt());
  
  arg = server.arg("relay_2_timeout");
  arg.trim();
  config.relay_2_timeout = (arg.length() == 0 ? 0 : arg.toInt());
  
  String channel = server.arg("mqtt_channel");
  channel.trim();
  if(!channel.endsWith("/"))
    channel += "/";
  config.mqtt_channel = channel;

  Serial.println(config.mqtt_server);

  File configFile = SPIFFS.open(ConfigFileName, "w");

  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use arduinojson.org/assistant to compute the capacity.
  StaticJsonDocument<512> jsonDocument;

  // Set the values in the document
  jsonDocument["mqtt_server"] = config.mqtt_server;
  jsonDocument["mqtt_port"] = config.mqtt_port;
  jsonDocument["mqtt_user"] = config.mqtt_user;
  jsonDocument["mqtt_password"] = config.mqtt_password;
  jsonDocument["mqtt_channel"] = config.mqtt_channel;
  jsonDocument["relay_1_name"] = config.relay_1_name;
  jsonDocument["relay_1_timeout"] = config.relay_1_timeout;
  jsonDocument["relay_2_name"] = config.relay_2_name;
  jsonDocument["relay_2_timeout"] = config.relay_2_timeout;

  // Serialize JSON to file
  if (serializeJson(jsonDocument, configFile) == 0) {
    Serial.println(F("Failed to write settings file."));
  }

  // Close the file
  configFile.close();

  // Reconnect MQTT to reflect changes
  connectMqtt();

  server.sendHeader("Location", "/config?saved=1", true);
  server.send(303, "text/plain"); 
}

