machv/esp8266-irrigator/src/main.cpp
void handle_OnConnect() {
  server.send(200, "text/html", SendHTML()); 
}

void handle_toggle() {
  if(!server.hasArg("id")) {
    server.send(400, "text/html", "Missing required id parameter.");
    return;
  }

  if(server.arg("id") == "1")
    toggleRelay(1);

  if(server.arg("id") == "2")
    toggleRelay(2);

  server.sendHeader("Location", "/");
  server.send(303, "text/plain");
}

void handle_NotFound() {
  server.send(404, "text/plain", "Not found");
}

// Callback function to be called when the button is pressed.
void onPressed1() {
	Serial.println("Button 1 has been pressed.");
  toggleRelay(1);
}

void onPressed2() {
	Serial.println("Button 2 has been pressed.");
  toggleRelay(2);
}

void meter0_triggered() {
  meters[0].pulseCounter++;

  Serial.printf("[FLOW] Flow meter 1 triggered, current counter = %d", meters[0].pulseCounter);
  Serial.println();
}
void meter1_triggered() {
  meters[1].pulseCounter++;

  Serial.printf("[FLOW] Flow meter 2 triggered, current counter = %d", meters[1].pulseCounter);
  Serial.println();
}

void meter_flowChanged(uint8_t pin) {
  int meterIndex = 0;
  bool meterFound = false;
  for(meterIndex = 0; meterIndex < RELAY_COUNT; meterIndex++) {
    if(METER_PINS[meterIndex] == pin) {
      meterFound = true;
      break;
    }
  }

  if(!meterFound) {
    Serial.printf("[FLOW] Unable to find meter index for PIN %d", pin);
    Serial.println();

    return;
  }

  if(mqttClient.connected()) {
    String channelCurrent = String(config.mqtt_channel + meterIndex + "/currentFlow");
    String valueCurrent = String(meters[meterIndex].flowRate);
    mqttClient.publish(channelCurrent.c_str(), valueCurrent.c_str());

    String channelTotal = String(config.mqtt_channel + meterIndex + "/totalFlow");
    String valueTotal = String(meters[meterIndex].totalMilliLitres);
    mqttClient.publish(channelTotal.c_str(), valueTotal.c_str());
  }
}

void setup() {
  // For testing
  //SPIFFS.format();
  //WiFiManager.reset();

  // Set serial console Baud ate
  Serial.begin(115200);

  // Initialize the button.
	button1.begin();
  button1.onPressed(onPressed1);
  
  button2.begin();
  button2.onPressed(onPressed2);
	
  // Initialize GPIO PINs
  pinMode(PinLed1, OUTPUT);
  pinMode(PinLed2, OUTPUT);
  pinMode(PinRelay1, OUTPUT);
  digitalWrite(PinRelay1, HIGH); // by default turn it off (=HIGH)
  pinMode(PinRelay2, OUTPUT);
  digitalWrite(PinRelay2, HIGH); // by default turn it off (=HIGH)

  // Prepare meters...
  meters[0].begin(METER_PINS[0], meter0_triggered);
  meters[1].begin(METER_PINS[1], meter1_triggered);
  for(int i = 0; i < RELAY_COUNT; i++) {
    meters[i].onFlowChanged(meter_flowChanged);
  }

  // !!! using internal LED (LED_BUILTIN) blocks internal TTY output !!! On-board LED je připojena mezi TX1 = GPIO2 a VCC 

  // Set led pin as output
  pinMode(PinLedStatus, OUTPUT);
  // Start ticker with 0.5 because we start in AP mode and try to connect
  ticker.attach(0.6, tickStatusLed);

  // WiFiManager
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(120);
  
  if(!wifiManager.autoConnect("Zavlazovac-Setup")) {
      Serial.println("failed to connect and hit timeout");
      delay(3000);

      // Reset and try again, or maybe put it to deep sleep
      ESP.reset();
      delay(5000);
  } 

  // Set callback that gets called when connecting to previous WiFi fails, and enters Access Point mode
  wifiManager.setAPCallback(configModeCallback);

  // If we get here we have connected to the WiFi
  ticker.detach();
  // Keep status LED on
  digitalWrite(PinLedStatus, HIGH);

  // init values from file system
  if (SPIFFS.begin()) {
    Serial.println("File system is mounted.");

    // read config file
    if(SPIFFS.exists(ConfigFileName))
    {
      Serial.println("Reading existing configuration.");

      File configFile = SPIFFS.open(ConfigFileName, "r");

      StaticJsonDocument<512> json;
      DeserializationError error = deserializeJson(json, configFile);
      if (error)
        Serial.println(F("Failed to read file, using default configuration"));

        // Copy values from the JsonDocument to the Config
        config.mqtt_port = json["mqtt_port"] | 1883;
        config.mqtt_server = json["mqtt_server"].as<String>();
        config.mqtt_user = json["mqtt_user"].as<String>();
        config.mqtt_password = json["mqtt_password"].as<String>();
        config.mqtt_channel = json["mqtt_channel"].as<String>();
        config.relay_1_name = json["relay_1_name"].as<String>();
        if(config.relay_1_name.length() == 0) {
          config.relay_1_name = "Relay 1";
        }
        config.relay_2_name = json["relay_2_name"].as<String>();
        if(config.relay_2_name.length() == 0) {
          config.relay_2_name = "Relay 2";
        }
        config.relay_1_timeout = json["relay_1_timeout"] | 0;
        config.relay_2_timeout = json["relay_2_timeout"] | 0;

        configFile.close();
    }
  }

  // setup MQTT
  connectMqtt();

  // Web server pages
  server.on("/", handle_OnConnect);
  server.on("/config", HTTP_GET, handle_pageConfig);
  server.on("/config", HTTP_POST, handle_saveConfig);
  server.on("/toggle", handle_toggle);
  server.on("/style.css", handle_stylesheetFile);
  server.on("/scripts.js", handle_jsFile);
  server.onNotFound(handle_NotFound);  
  server.begin();
  Serial.println("HTTP server started");
}

void loop() {
  // Process web server requests
  server.handleClient();
  
  // MQTT reconnect if no connection with non-blocking delay
  if(!mqttClient.connected() && ((millis() - lastMqttConnectionRetryTime) > mqttReconnectDelay)) {
    setupMqtt(1);
  }
  
  // Process MQTT communication
  mqttClient.loop();
  
  // Continuously read the status of the button. 
	button1.read();
  button2.read();

  // Process relay timeouts
  if(config.relay_1_timeout > 0 && relay1timeoutWhen > 0 && relay1timeoutWhen < millis()) {
    Serial.println("Configured timeout for relay 1 exceeded -> toggling");
    toggleRelay(1);
  }

  if(config.relay_2_timeout > 0 && relay2timeoutWhen > 0 && relay2timeoutWhen < millis()) {
    Serial.println("Configured timeout for relay 2 exceeded -> toggling");
    toggleRelay(2);
  }

  for(int i = 0; i < RELAY_COUNT; i++) {
    meters[i].loop();
  }
}
